Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyIncompleteElement Property
 Can't copy part of element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyIncompleteElement { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyIncompleteElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyIncompleteElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace